/* Գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) բնական թիվ, ապա
հաջորդականություն N ամբողջ տարրերից կազմված։ Որպես արդյունք ծրագիրը
պետք է արտածի հաջորդականությունում վերջին տարրից տարբեր տարրերի քանակը։
Խնդիրը լուծելիս օգտագործել զանգված։
 */

/*  4 1 2 3 4
Результат работы
3
Входные данные
4 1 1 1 1
Результат работы
0 */

#include <iostream>

int main() {

  int n;

  std::cin >> n;

  int arr[1000];

  int count = 0;

  for (int i = 0; i < n; i++) {
    std::cin >> arr[i];     
 }

  for (int j = 0; j < n; j++) {
    if(arr[j] != arr[n-1]){
        count++;

        if(arr[n-1] == 0){
          count = 0;
        }   
    }
 }

 std::cout << count;
}