/* Задача 15: Մեծությամբ երկրորդը
Գրել ծրագիր, որը մուտքում կստանա 3 ամբողջ թիվ և կարտածի այդ թվերից մեծությամբ
երկրորդը։ (դաս 4)

Примеры
Входные данные
1 2 3
Результат работы
2
Входные данные
-1 1 0
Результат работы
0
Входные данные
10 100 10000
Результат работы
100 */

#include <iostream>

int main() {

    int a = 0;
    int b = 0;
    int c = 0;

   std::cin >> a >> b >> c;
   
   if ((a < b && a > c) || (a > b && a < c))
     std::cout << a;
   else if((b < c && b > a) || (b > c && b < a))
    std::cout << b;
   else
    std::cout << c; 
}