/* Задача 2: Ուղղանկյան մակերես
Գրել ծրագիր, որը մուտքում կստանա ուղղանկյան 2 կողմերի 
երկարությունը և կարտածի այդ ուղղանկյան մակերեսը։ (դաս 2)

Примеры
Входные данные
1 1
Результат работы
1
Входные данные
2 4
Результат работы
8 */

#include <iostream>

int main() {
  int a;
  int b;
  std::cin >> a >> b;
  std::cout << a*b;
}