/* Задача 14: Զույգ է և ոչ միայն
Գրել ծրագիր, որը մուտքում կստանա ամբողջ թիվ և կարտածի YES, եթե այդ թիվը
զույգ է և 7֊ի բաժանելիս մնացորդում կմնա 3 և NO հակառակ դեպքում։ (դաս 4)

Примеры
Входные данные
10
Результат работы
YES
Входные данные
8
Результат работы
NO
Входные данные
24
Результат работы
YES */

#include <iostream>

int main() {

    int n = 0;

   std::cin >> n;
   
   if (n % 2 == 0 && n % 7 == 3)
     std::cout << "YES";
    else 
    std::cout << "NO"; 
}