/* Задача 11: Հավասարություն
Գրել ծրագիր, որը մուտքում կստանա 2 դրական ամբողջ թիվ և կարտածի YES,
եթե այդ թվերը հավասար են և NO հակառակ դեպքում։ (դաս 4)

Примеры
Входные данные
1 1
Результат работы
YES
Входные данные
4 5
Результат работы
NO
 */
 
#include <iostream>

int main() {

   unsigned int a;
   unsigned int b;

   std::cin >> a >> b;

   if (a == b)
     std::cout << "YES";
   else
      std::cout << "NO";
}
