/* Задача 14: Զանգվածների տարբերություն
Պահանջվում է գրել ծրագիր, որը մուտքում կստանա 10 երկարությամբ երկու
ամբողջ թվերի հաջորդականություն և կարտածի բոլոր այն տարրերը առաջին 
հաջորդականությունից, որոնք չկան երկրորդում։ Արտածվող թվերը միմյանցից 
պետք է բաժանված լինեն բացատանիշով և պետք է արտածվեն նույն հերթականությամբ
ինչպես ներմուծվել են։ Խնդիրը լուծելիս օգտագործել զանգված։ (դաս 7)

Примеры
Входные данные
1 2 3 4 5 6 7 8 9 10
1 2 3 4 5 6 7 8 9 10
Результат работы
Входные данные
10 20 30 40 50 60 70 80 90 100
10 20 30 40 50 50 40 30 20 10
Результат работы
60 70 80 90 100
Входные данные
1 2 3 4 5 6 7 8 9 10
-1 -2 -3 -4 -5 -6 -7 -8 -9 -10
Результат работы
1 2 3 4 5 6 7 8 9 10 */

#include <iostream>

int main() {

  const int n = 10;

  int a[n];
  int b[n];

  int num[n] = {};

  unsigned int k = 0;

  for (int i = 0; i < n; i++) {
    std::cin >> a[i];    
  }

  for (int i = 0; i < n; i++) {
    std::cin >> b[i];     
  }

  for (int i = 0; i < n; ++i){

    bool isBool = true;

   for (int j = 0; j < n; j++){
     if(a[i] == b[j]){
        isBool = false;
        break;
    }
  }
  if(isBool){
    num[k++] = a[i];
  }
}
  for (int i = 0; i < k; i++) {
    std::cout << num[i] << " ";     
  } 
  
}