/* Задача 19: Պայմանով արտահայտություն
Գրել ծրագիր, որը մոտքում կստանա A, B, C և D ամբողջ թվերը։ Պահանջվում է արտածել A և D թվերի արտադրյալի ու B և C թվերի գումարի տարբերությունը, եթե A-ն գերազանցում է C֊ն։ B և D թվերի գումարի և A֊ի արտադրյալը, եթե C-ն գերազանցում է A֊ն: Հակառակ դեպքում բոլոր չորս թվերի գումարը։ (դաս 4)

Примеры
Входные данные
9 3 10 5
Результат работы
72
Входные данные
10 3 10 5
Результат работы
28
Входные данные
10 3 9 5
Результат работы
38
 */
 
#include <iostream>

int main() {

    int A = 0;
    int B = 0;
    int C = 0;
    int D = 0;

   std::cin >> A >> B >> C >> D;
   
   if (A>C)
     std::cout << (A*D)-(B+C);
   else if(C>A)
     std::cout << (B+D)*A;
   else
   std::cout << A+B+C+D;
}