/* Задача 18: Նվազման կարգ
Գրել ծրագիր, որը մուտքում կստանա 4 ամբողջ թիվ և կարտածի YES, եթե բոլոր թվերը 
մուտքագրվել են նվազման կարգով և NO հակառակ դեպքում։ (դաս 4)

Примеры
Входные данные
4 3 2 1
Результат работы
YES
Входные данные
4 3 2 5
Результат работы
NO
Входные данные
5 5 5 5
Результат работы
YES */


#include <iostream>

int main() {

    int a = 0;
    int b = 0;
    int c = 0;
    int d = 0;

   std::cin >> a >> b >> c >> d;
   
   if (a >= b && a >= c && a >= d && b >= c && c >= d)
     std::cout << "YES";
   else 
   std::cout << "NO";
}