/* Задача 3: Մնացորդ
Գրել ծրագիր, որը մուտքում կստանա A և B դրական ամբողջ թվերը և կարտածի A֊ն B֊ի 
բաժանման արդյունքում ստացված մնացորդը։ Հայտնի է, որ B֊ն 0 չէ։ (դաս 2)

Примеры
Входные данные
7 5
Результат работы
2
Входные данные
3 6
Результат работы
3
Входные данные
20 10
Результат работы
0 */

#include <iostream>

int main() {
  int a;
  int b;
  std::cin >> a >> b;
  std::cout << a%b;
}