/* Задача 7: Տարբերություն
Գրել ծրագիր, որը մուտքում ստանում է N բնական թիվ, ապա հաջորդականություն N ամբողջ
տարրերից կազմված։ Որպես արդյունք ծրագիրը պետք է արտածի հաջորականության մեծագույն
և փոքրագույն տարրերի տարբերութունը։ Արգելվում է օգտագործել զանգված։ (դաս 5, 6)

Примеры
Входные данные
1 5
Результат работы
0
Входные данные
5 -10 15 -2 7 20
Результат работы
30
 */
#include <iostream>
#include <limits>

int main() {

  int diff;

  int max = std::numeric_limits<int>::min();
  int min = std::numeric_limits<int>::max();

  int n;

  std::cin >> n;
  
  for(int i=0; i<n; ++i){
    int x;
    std::cin >> x;
      if(x > max){
        max = x;
      }

      if(x<min){
        min = x;
      }
 }
 
 std::cout << max-min;

}