/* Գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) բնական թիվ,
ապա հաջորդականություն N ամբողջ տարրերից կազմված։ Որպես արդյունք
ծրագիրը պետք է արտածի հաջորդականությունը հակառակ կարգով։
Խնդիրը լուծելիս օգտագործել զանգված։ */

/* 5 1 2 3 4 5
Результат работы
5 4 3 2 1
Входные данные
10 -100 100 -753 999 -159 9 45 7 -8 -1
Результат работы
-1 -8 7 45 9 -159 999 -753 100 -100 */

#include <iostream>

int main() {

 int n;

 std::cin >> n;

 int arr[1000];

 int reverse[1000];

 for (int i = 0; i < n; i++) {
    std::cin >> arr[i];     
 }

 for (int i = 0; i < n; i++) {
    reverse[i] = arr[n-i-1];
 } 

 for (int i = 0; i < n; i++) {
    std::cout<< reverse[i] << " ";
 }
 
}