/* Задача 4: Սեղանի մակերես
Պահանջվում է գրել ծրագիր, որը մուտքում կստանա ուղղանկյուն սեղանի հիմքերը
ու բարձրությունը և կհաշվի այդ սեղանի մակերեսը։ (դաս 2)

Примеры
Входные данные
1 1 1
Результат работы
1
Входные данные
2 1 1
Результат работы
1.5
Входные данные
4 2 5
Результат работы
15
 */

#include <iostream>

int main() {
  double a;
  double b;
  double h;
  std::cin >> a >> b >> h;
  std::cout << (a+b)/2*h;
}
