/* Задача 1: Գումար
Գրել ծրագիր, որը մուտքում կստանա 2 ամբողջ թիվ և կարտածի այդ թվերի գումարը։ (դաս 2)

Примеры
Входные данные
1 1
Результат работы
2
Входные данные
2 3
Результат работы
5 */

#include <iostream>

int main() {
  int a;
  int b;
  std::cin >> a >> b;
  std::cout << a+b;
}