/* Задача 6: Սահող կետով թվերի բաժանում
Գրել ծրագիր, որը մուտքում կստանա 2 սահող կետով թիվ և կարտածի առաջինի
և երկրորդի բաժանման արդյունքում ստացված քանորդը։ (դաս 2)

Примеры
Входные данные
1 2
Результат работы
0.5
Входные данные
1 3
Результат работы
0.333333 */

#include <iostream>

int main() {
  double a;
  double b;
  std::cin >> a >> b;
  std::cout << a/b;
}