/* Задача 4: Պարզ թվեր
Գրել ծրագիր, որը մուտքում կստանա դրական թիվ և կարտածի մինչև այդ թիվը եղած 
բոլոր պարզ թվերը։ Արտածվող թվերը միմյանցից պետք է բաժանված լինեն բացատանիշով։
(դաս 5, 6)

Примеры
Входные данные
2
Результат работы
2
Входные данные
5
Результат работы
2 3 5
Входные данные
15
Результат работы
2 3 5 7 11 13
 */
#include <iostream>

int main() {

  int n, j, i;
  std::cin >> n;

  for(i=2; i<=n; ++i){
    for(j=2; j<=i; ++j){
     if (i%j==0) {
        break;
        }
    }
     if (i == j) {
         std::cout<<i<<" ";
   }
  }  
}