/* Задача 5: Սահող կետով թվերի գումար
Պահանջվում է գրել ծրագիր, որը մուտքում կստանա 4 սահող կետով թվեր և կարտածի առաջին երկուսի գումարի և մյուս երկուսի գումարների տարբերությունը։ (դաս 2)

Примеры
Входные данные
4.5 3.5 1.75 2.25
Результат работы
4
Входные данные
4.5 3.5 -1.75 -2.25
Результат работы
12 */

#include <iostream>

int main() {
  double a;
  double b;
  double c;
  double d;
  std::cin >> a >> b >> c >> d;
  std::cout << (a+b)-(c+d);
}