/* Задача 7: Սահող կետով և ամբողջ թվեր
Գրել ծրագիր, որը մուտքում կստանա 3 ամբողջ թիվ և 1 սահող կետով թիվ։ 
Ծրագիրը որպես արդյունք պետք է արտածի ամբողջ թվերի գումարի և սահող կետով թվի բաժանման արդյունքում ստացված քանորդը։ Հայտնի է, որ սահող կետով թիվը հավասար չէ 0֊ի։ (դաս 3)

Примеры
Входные данные
1 2 3 1.5
Результат работы
4
Входные данные
1 0 0 3
Результат работы
0.333333 */

#include <iostream>

int main() {
  int a;
  int b;
  int c;
  double d;
  std::cin >> a >> b >> c >> d;
  std::cout << (a+b+c)/d;
}
