/* Задача 13: Նախ բացասականները
Պահանջվում է գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) բնական թիվ, 
ապա հաջորդականություն N ամբողջ տարրերից կազմված։ Անհրաժեշտ է, որ ծրագիրը
նախ արտածի հաջորդականության բացասական տարրերը ապա ոչ բացասականները։ 
Արտածվող թվերը միմյանցից պետք է բաժանված լինեն բացատանիշով։ Խնդիրը
լուծելիս օգտագործել զանգված։ (դաս 7)

Примеры
Входные данные
4 0 -2 6 -8
Результат работы
-2 -8 0 6
Входные данные
10 1 2 3 4 5 6 7 8 9 10
Результат работы
1 2 3 4 5 6 7 8 9 10
Входные данные
3 -1 -2 -3
Результат работы
-1 -2 -3 */


#include <iostream>

int main() {

 int n;

  std::cin >> n;

  int arr[1000];

  for (int i = 0; i < n; i++) {
    std::cin >> arr[i];     
  }

  int negative[1000] = {};
  int positive[1000] = {};

  unsigned int j = 0;
  unsigned int k = 0;
 
    for (unsigned int i = 0; i < n; i++) { 
       if(arr[i] < 0){
         negative[j++] = arr[i];
       }else {
         positive[k++] = arr[i];
       }
    }

  for (int i = 0; i < j; i++) {
    std::cout << negative[i] << " ";     
  }
  for (int i = 0; i < k; i++) {
    std::cout << positive[i] << " ";     
  }
}