/* Задача 20: Հակադիր թվեր
Գրել ծրագիր, որը մուտքում կստանա A, B, C և D ամբողջ թվերը։ Պահանջվում է 
արտածել YES եթե A-ն հակադիր է D֊ին և B֊ն հակադիր չէ C ֊ին, NO հակառակ դեպքում։
(դաս 4)

Примеры
Входные данные
1 2 3 -1
Результат работы
YES
Входные данные
1 2 -2 -1
Результат работы
NO */

#include <iostream>

int main() {

    int A = 0;
    int B = 0;
    int C = 0;
    int D = 0;

   std::cin >> A >> B >> C >> D;
   
   if (A+D == 0 && B+C != 0)
     std::cout << "YES";
   else
     std::cout << "NO";

}