/* Задача 20: Insertion sort
Պահանջվում է գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) բնական թիվ, 
ապա հաջորդականություն N ամբողջ տարրերից կազմված։ Անհրաժեշտ է, որ ծրագիրը 
արտածի հաջորդականության տարրերը դասավորված նվազման կարգով։ Արտածվող թվերը 
միմյանցից պետք է բաժանված լինեն բացատանիշով։ Խնդիրը լուծելիս օգտագործել 
զանգված և insertion sort ալգորիթմ։ (դաս 8)

Примеры
Входные данные
10 1 2 3 4 5 6 7 8 9 10
Результат работы
10 9 8 7 6 5 4 3 2 1
Входные данные
5 -1 8 -15 99 -100
Результат работы
99 8 -1 -15 -100 */

#include <iostream>

int main() {

  int n;

  std::cin >> n;

  int a[1000];

  for(unsigned int i = 0; i<n; i++){
    std::cin >> a[i];
  }

  int i, key;

  for(i = 1; i < n; ++i){
      
      key = a[i];
      int j;

      for(j = i -1; j>=0 && a[j] < key; --j){
        a[j+1] = a[j];

      }
      a[j+1] = key;
  }

  for(int i =0; i<n; i++){
    std::cout << a[i] << " ";
  }
}