/* Задача 19: Bubble sort
Պահանջվում է գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) բնական թիվ, 
ապա հաջորդականություն N ամբողջ տարրերից կազմված։ Անհրաժեշտ է, որ ծրագիրը 
արտածի հաջորդականության տարրերը դասավորված նվազման կարգով։ Արտածվող թվերը 
միմյանցից պետք է բաժանված լինեն բացատանիշով։ Խնդիրը լուծելիս օգտագործել 
զանգված և bubble sort ալգորիթմ։ (դաս 8)

Примеры
Входные данные
10 1 2 3 4 5 6 7 8 9 10
Результат работы
10 9 8 7 6 5 4 3 2 1
Входные данные
5 -1 8 -15 99 -100
Результат работы
99 8 -1 -15 -100 */

#include <iostream>
#include <utility>

int main() {

  int n;

  std::cin >> n;

  int a[1000];

  for(unsigned int i = 0; i<n; i++){
    std::cin >> a[i];
  }


  for(unsigned int i = 0; i<n-1; i++){
    bool swapped = false;
    for(unsigned int j = 1; j<n-i; j++){
      if(a[j-1] < a[j]){
        std::swap(a[j-1], a[j]);
        swapped = true;
      }
     }
     if(!swapped){
       break;
    }
    
  }
  for(unsigned int i =0; i<n; i++){
    std::cout << a[i] << " ";
  }
}