/* Գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 1000) բնական թիվ, ապա
հաջորդականություն N սիմվոլներից կազմված։ Որպես արդյունք ծրագիրը 
պետք է արտածի հաջորդականության թվանշանները ապա մնացած սիմվոլները։
Արտածվող սիմվոլները միմյանցից պետք է բաժանված լինեն բացատանիշով։
 Խնդիրը լուծելիս օգտագործել զանգված։ (դաս 7)

Примеры
Входные данные
5 a 1 2 r 4
Результат работы
1 2 4 a r
Входные данные
10 a s d @ # $ 7 8 9 1
Результат работы
7 8 9 1 a s d @ # $ */

#include <iostream>

int main() {

 int n;

  std::cin >> n;

  char arr[1000];

  for (int i = 0; i < n; i++) {
    std::cin >> arr[i];     
  }

  char num[1000] = {};
  char symbol[1000] = {};

  unsigned int j = 0;
  unsigned int k = 0;
 
    for (unsigned int i = 0; i < n; i++) { 
       if(arr[i] > 47 && arr[i] < 58){
         num[j++] = arr[i];
       }else {
         symbol[k++] = arr[i];
       }
    }

  for (int i = 0; i < j; i++) {
    std::cout << num[i] << " ";     
  }
  for (int i = 0; i < k; i++) {
    std::cout << symbol[i] << " ";     
  }
}