/* Задача 17: Չի կրկնվում միայն
Պահանջվում է գրել ծրագիր, որը մուտքում ստանում է N (N ≤ 100) բնական թիվ,
ապա հաջորդականություն N ամբողջ տարրերից կազմված։ Հայտնի է, որ հաջորդականության 
բոլոր տարրերը հանդիպում են ճիշտ երկու անգամ բացառությամբ մեկի։ Պահանջվում է 
արտածել մեկ անգամ հանդիպող տարրը և կարգահամարը հաջորդականությունում։ 
Խնդիրը լուծելիս օգտագործել զանգված։ (դաս 7)

Примеры
Входные данные
5 1 1 3 4 4
Результат работы
3 2
Входные данные
9 -1 4 5 4 -1 7 6 6 5
Результат работы
7 5 */

#include <iostream>

int main() {

  int n;
  std::cin >> n;

  int a[1000];
  int b[1000];

  int count = 0;

  int foundElem = 0;

  for(int i =0; i<n; i++){
    std::cin >> a[i];
  }

  int i,j;

  for(i = 0; i < n; i++) {
   for(j = 0; j < n; j++) {
     if(a[i] == a[j] && i != j)
       break;
    }
  if(j == n ) {
     foundElem = a[i];
     std::cout << foundElem << " ";
    }
  }

  for (int i = 0; i < n; i++) {
    if(foundElem == a[i]){
      count = i;
    }    
  }
  std::cout << count << " ";

}


