/* Задача 8: Սահող կետով և ամբողջ թվեր (2)
Պահանջվում է գրել ծրագիր, որը մուտքում կստանա A և B ամբողջ թվերը, 
ապա C և D սահող կետով թվերը։ Որպես արդյունք ծրագիրը պետք է արտածի 
A * C - B / D արտահայտության արժեքը։ Հայտնի է, որ D֊ն 0 չէ։ (դաս 3)

Примеры
Входные данные
3 10 0.111111 3
Результат работы
-3
Входные данные
3 10 0.111111 -3
Результат работы
3.66667 */

#include <iostream>

int main() {
  int a;
  int b;
  double c;
  double d;
  std::cin >> a >> b >> c >> d;
  std::cout << a * c - b / d;
}
