/* Задача 13: Երեքից փոքրը
Գրել ծրագիր, որը մուտքում կստանա 3 ամբողջ թիվ և կարտածի այդ թվերից փոքրը։ (դաս 4)

Примеры
Входные данные
1 2 3
Результат работы
1
Входные данные
-1 -2 -3
Результат работы
-3
Входные данные
0 -7 45
Результат работы
-7 */

#include <iostream>

int main() {

    int a = 0;
    int b = 0;
    int c = 0;

   std::cin >> a >> b >> c;
   
   if (a < b && a < c)
     std::cout << a;
   else if(b < c && b < c)
    std::cout << b;
   else 
    std::cout << c; 
}